Public Member Functions | Public Attributes | List of all members
API_NavigatorAddOnViewPointData Struct Reference
Project Navigator
Describes a Navigator AddOn viewpoint root, group or leaf node. More...
#include <APIdefs_Navigator.h>
 Public Member Functions
API_NavigatorAddOnViewPointData ()
Default constructor for API_NavigatorAddOnViewPointData. Construct an undefined viewpoint.
API_NavigatorAddOnViewPointData (const API_NavigatorAddOnViewPointData &source)
Copy constructor for API_NavigatorAddOnViewPointData.
API_NavigatorAddOnViewPointData (API_NavigatorAddOnViewPointData &&source)
Move constructor for API_NavigatorAddOnViewPointData.
void  | operator= (const API_NavigatorAddOnViewPointData &source)
Copy assignement operator for API_NavigatorAddOnViewPointData.
void  | operator= (API_NavigatorAddOnViewPointData &&source)
Move assignement operator for API_NavigatorAddOnViewPointData.
 Public Attributes
 GS::UniString  | displayId
The display ID of the viewpoint.
 GS::UniString  | displayName
The display name of the viewpoint.
 API_NavigatorAddOnViewPointTypeID  | itemType
The type of the viewpoint: root, group or leaf node. See API_NavigatorAddOnViewPointTypeID.
 Int32  | iconId
Identifier of the icon.
 API_Guid  | guid
Unique ID of the viewpoint.
 API_Guid  | parentGuid
Unique ID of the parent root/group of the viewpoint. The parent of a root is APINULLGuid.
 GSHandle  | data
The data stored by the AddOn in this viewpoint.
 UInt32  | viewSettingsFlags
Specifies which view settings are enabled in this viewpoint leaf node. Not applicable for viewpoint roots or groups. The value of this member can be set by combining the flags in API_NavigatorViewSettingsFlags.
Detailed Description
Describes a Navigator AddOn viewpoint root, group or leaf node.
Remarks
This is not POD type.
Do not use memset, BNZeroMemory or BNClear to initialize an object of this class. The constructors will initialize it.
Do not use BMKillHandle or BMHandleToHandle to manage the lifetime of the data member. The constructors, destructors and assignment operators of the class will manage it.
Constructor & Destructor Documentation
◆ API_NavigatorAddOnViewPointData() [1/2]
 API_NavigatorAddOnViewPointData::API_NavigatorAddOnViewPointData  |  ( |  const API_NavigatorAddOnViewPointData & |  source | )
inline
Copy constructor for API_NavigatorAddOnViewPointData.
Parameters
source | The other API_NavigatorAddOnViewPointData object.
◆ API_NavigatorAddOnViewPointData() [2/2]
 API_NavigatorAddOnViewPointData::API_NavigatorAddOnViewPointData  |  ( |  API_NavigatorAddOnViewPointData && |  source | )
inline
Move constructor for API_NavigatorAddOnViewPointData.
Parameters
source | The other API_NavigatorAddOnViewPointData object.
Member Function Documentation
◆ operator=() [1/2]
 void API_NavigatorAddOnViewPointData::operator=  |  ( |  API_NavigatorAddOnViewPointData && |  source | )
inline
Move assignement operator for API_NavigatorAddOnViewPointData.
Parameters
source | The other API_NavigatorAddOnViewPointData object.
◆ operator=() [2/2]
 void API_NavigatorAddOnViewPointData::operator=  |  ( |  const API_NavigatorAddOnViewPointData & |  source | )
inline
Copy assignement operator for API_NavigatorAddOnViewPointData.
Parameters
source | The other API_NavigatorAddOnViewPointData object.